Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом/РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Сторона</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом.Сторона
	|ИЗ
	|	РегистрСведений.РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом КАК РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом
	|ГДЕ
	|	РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом.Контрагент = &Контрагент
	|	И РЭЙ_СопоставлениеСтороныПоСделкеСКонтрагентом.Сторона <> &Сторона";
	
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект.Контрагент);
	Запрос.УстановитьПараметр("Сторона", ТекущийОбъект.Сторона);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить(СтрШаблон("Для контрагента %1 соответствие элементу справочника %2: %3", ТекущийОбъект.Контрагент.Наименование, Выборка.Сторона.Метаданные().Имя, Выборка.Сторона.Наименование));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
